ROWS_PER_PAGE = 5
TOTAL_QUESTIONS = 25
TOTAL_PAGES = 5

A1_LEVEL_DESC = '''Рівень володіння англійською мовою A1 відповідає початковому рівню вивчення мови, і він характеризується обмеженим розумінням і використанням англійської мови. Ось деякі основні риси цього рівня:\n
    <b>Розуміння</b>: На рівні A1 ви зазвичай розумієте базові слова та короткі фрази, які вживаються в повсякденному спілкуванні. Ви можете розуміти вимоги та інструкції у простих контекстах.
    <b>Говоріння</b>: Ваша здатність говорити на англійській обмежена до коротких фраз і виразів. Ви можете відповісти на прості запитання про себе, такі як ім'я, вік і місце проживання.
    <b>Читання</b>: Ви можете читати короткі та прості тексти, які містять загальну інформацію, таку як меню в кафе, розклад транспорту або заголовки новин.
    <b>Письмо</b>: На цьому рівні ви здатні писати короткі повідомлення або записки, наприклад, прості листи, що містять базову інформацію.\n
    Цей рівень володіння англійською мовою є стартовим і відповідає основам мовного навчання. Щоб покращити свої навички та перейти на більш високий рівень, вам слід продовжувати вивчення англійської мови, розширювати словниковий запас і практикувати більше говоріння та читання.'''

A2_LEVEL_DESC = '''Рівень володіння англійською мовою A2 відповідає базовому рівню володіння мовою, і це часто описується як "елементарний" рівень. Ось деякі характеристики рівня A2:\n
    <b>Розуміння</b>: Людина на рівні A2 здатна розуміти прості розмови, які стосуються повсякденних ситуацій, як наприклад покупки, відвідини лікаря, замовлення їжі в ресторані тощо.
    <b>Говоріння</b>: Здатність розповідати про себе, свою родину та своє навколишнє середовище за допомогою простих фраз та речень. Можливість вести прості розмови на теми, що стосуються повсякденного життя.
    <b>Читання</b>: Здатність розуміти простий письмовий матеріал, такий як короткі повідомлення, оголошення, електронні листи та короткі тексти в книгах чи журналах.
    <b>Письмо</b>: Здатність писати короткі повідомлення, записки та листи на повсякденні теми, використовуючи просту лексику та граматику.\n
    За рівнем A2, особа здатна спілкуватися у простих ситуаціях повсякденного життя, але її володіння мовою є обмеженим, і вона може потребувати додаткового часу та зусиль для розуміння більш складних текстів або розмов.'''

B1_LEVEL_DESC = '''Рівень володіння англійською мовою B1 відповідає середньому рівню володіння мовою, який дозволяє особі спілкуватися на базовому рівні в різних ситуаціях. Цей рівень часто оцінюється за допомогою міжнародних стандартів, таких як Комунікативна Мовна Кадемія (CEFR). Основні характеристики рівня B1 включають:\n
    <b>Розуміння</b>: Людина, яка має рівень B1, може розуміти основний зміст простих текстів та діалогів на різні теми, такі як сім'я, робота, подорожі тощо.
    <b>Говоріння</b>: Особа може виражати свої думки та ідеї у повсякденних ситуаціях, використовуючи просту лексику та граматику. Вона може задавати питання та відповідати на них, розповідати про свої зацікавленості і досвід.
    <b>Читання</b>: Людина може розуміти прості тексти, які містять загальну інформацію, і дістати основну ідею тексту.
    <b>Письмо</b>: На рівні B1 особа може писати короткі повідомлення, листи, або записки на базовому рівні, використовуючи просту граматику та словниковий запас.\n
    Цей рівень є достатнім для ведення непрофесійних розмов, подорожей та базової комунікації в англомовному середовищі. Однак він не дозволяє виконувати більш складні мовні завдання або спілкуватися на професійному рівні. Для підвищення рівня володіння англійською мовою до більш високих рівнів, потрібна додаткова навчання та практика.'''

B2_LEVEL_DESC = '''Рівень володіння англійською мовою B2 відповідає середньому рівню володіння мовою згідно зі Спільною Європейською шкалою знань мов (CEFR - Common European Framework of Reference for Languages). Цей рівень вказує на те, що особа володіє досить гарними навичками англійської мови, щоб взаємодіяти і використовувати її в різних життєвих ситуаціях. Основні характеристики рівня B2 включають:\n
    <b>Розуміння</b>: Особа може розуміти основний контент стосовно звичайних ситуацій, таких як розмови про роботу, розваги, подорожі та інші повсякденні теми. Вона може розуміти загальний зміст текстів і повідомлень, хоча із складнішими словами і фразами може виникати труднощі.
    <b>Говоріння</b>: Особа здатна висловлювати свої думки і ідеї зрозуміло та логічно. Вона може активно брати участь у розмові, обговорюючи теми, які вже знає. Також може описувати події, враження, та висловлювати свої думки на різні теми.
    <b>Читання</b>: Особа може читати текст з загальних тем і розуміти головну ідею, а також деякі деталі. Це включає читання книг, статей та інших текстів.
    <b>Письмо</b>: Особа може писати тексти на різні теми, наводячи докази і аргументи в підтримку своїх поглядів. Хоча її письмо може мати деякі граматичні та структурні помилки, воно все ж багато в чому зрозуміле і чітке.\n
    Загалом, рівень B2 вважається гарним рівнем володіння англійською мовою для комунікації в різних ситуаціях і для багатьох видів діяльності, таких як подорожі, робота, освіта і розваги.'''

C1_LEVEL_DESC = '''Рівень володіння англійською мовою C1 відповідає високому і досить продвинутому рівню згідно із Спільною Європейською шкалою знань мов (CEFR - Common European Framework of Reference for Languages). Основні характеристики рівня C1 включають:\n
    <b>Розуміння</b>: Особа може розуміти високий рівень складності текстів і усніх мовних висловлювань. Вона може аналізувати глибокий зміст і нюанси, а також вміє розуміти інформацію з різних джерел, включаючи академічні, наукові та технічні тексти.
    <b>Говоріння</b>: Особа здатна виразити свої думки і ідеї чітко та точно, використовуючи багатий словник і складні структури мови. Вона може вести дискусії на різноманітні теми, а також ефективно вести переговори та презентації.
    <b>Читання</b>: Особа може читати та розуміти складні тексти, включаючи наукові статті, художню літературу та технічну документацію. Вона може критично оцінювати інформацію та аргументи в текстах.
    <b>Письмо</b>: Особа може писати різні типи текстів, включаючи наукові дослідження, літературні твори, статті та ділові документи. Її письмо характеризується високою якістю, структурною зрілістю та використанням різноманітних стилів.\n
    Рівень C1 вважається високим і часто потрібним для роботи та навчання в англомовному середовищі, а також для професійного та наукового спілкування. Володіння англійською на цьому рівні відкриває багато можливостей для розширення горизонтів і досягнення особистих та професійних цілей.'''